# Cadence Genus(TM) Synthesis Solution, Version 18.14-s037_1, built Mar 27 2019 12:19:21

# Date: Mon Nov 27 20:05:23 2023
# Host: nightwing.ece.northwestern.edu (x86_64 w/Linux 4.18.0-513.5.1.el8_9.x86_64) (8cores*8cpus*1physical cpu*Intel(R) Core(TM) i7-9700 CPU @ 3.00GHz 12288KB)
# OS:   Red Hat Enterprise Linux release 8.9 (Ootpa)

read_hdl ../ RF.v   hardfloat/addRecFN.v   hardfloat/compareRecFN.v   hardfloat/fNToRecFN.v   hardfloat/HardFloat_primitives.v   hardfloat/HardFloat_specialize.v   hardfloat/recFNToIN.v   hardfloat/recFNToFN.v   hardfloat/mulRecFN.v   hardfloat/HardFloat_rawFN.v   hardfloat/isSigNaNRecFN.v   hardfloat/iNToRecFN.v      hardfloat/divSqrtRecFN_small.v   Core.v   InstrDecoder.v  IntALU.v   Load.v   AGU.v   StoreAGU.v   ProgramCounter.v   Rename.v   FPU.v   FDiv.v   FMul.v    ROB.v   BranchPredictor.v   IndirectBranchPredictor.v   LoadBuffer.v   StoreQueue.v   Multiply.v   Divide.v   ControlRegs.v   PopCnt.v   LZCnt.v   BranchSelector.v   PreDecode.v   RenameTable.v   TagBuffer.v   IssueQueue.v   CacheController.v      PCFile.v   LoadStoreUnit.v   TageTable.v   TagePredictor.v   BranchTargetBuffer.v   ICacheTable.v   BranchPredictionTable.v   ReturnStack.v
read_hdl ../RF.v
read_hdl   iverilog -v  ../RF.v   ../hardfloat/addRecFN.v   ../hardfloat/compareRecFN.v   ../hardfloat/fNToRecFN.v   ../hardfloat/HardFloat_primitives.v   ../hardfloat/HardFloat_specialize.v   ../hardfloat/recFNToIN.v   ../hardfloat/recFNToFN.v   ../hardfloat/mulRecFN.v   ../hardfloat/HardFloat_rawFN.v   ../hardfloat/isSigNaNRecFN.v   ../hardfloat/iNToRecFN.v      ../hardfloat/divSqrtRecFN_small.v   ../Core.v   ../InstrDecoder.v  ../IntALU.v   ../Load.v   ../AGU.v   ../StoreAGU.v   ../ProgramCounter.v   ../Rename.v   ../FPU.v   ../FDiv.v   ../FMul.v    ../ROB.v   ../BranchPredictor.v   ../IndirectBranchPredictor.v   ../LoadBuffer.v   ../StoreQueue.v   ../Multiply.v   ../Divide.v   ../ControlRegs.v   ../PopCnt.v   ../LZCnt.v   ../BranchSelector.v   ../PreDecode.v   ../RenameTable.v   ../TagBuffer.v   ../IssueQueue.v   ../CacheController.v      ../PCFile.v   ../LoadStoreUnit.v   ../TageTable.v   ../TagePredictor.v   ../BranchTargetBuffer.v   ../ICacheTable.v   ../BranchPredictionTable.v   ../Ret
read_hdl ../RF.v   ../hardfloat/addRecFN.v   ../hardfloat/compareRecFN.v   ../hardfloat/fNToRecFN.v   ../hardfloat/HardFloat_primitives.v   ../hardfloat/HardFloat_specialize.v   ../hardfloat/recFNToIN.v   ../hardfloat/recFNToFN.v   ../hardfloat/mulRecFN.v   ../hardfloat/HardFloat_rawFN.v   ../hardfloat/isSigNaNRecFN.v   ../hardfloat/iNToRecFN.v      ../hardfloat/divSqrtRecFN_small.v   ../Core.v   ../InstrDecoder.v  ../IntALU.v   ../Load.v   ../AGU.v   ../StoreAGU.v   ../ProgramCounter.v   ../Rename.v   ../FPU.v   ../FDiv.v   ../FMul.v    ../ROB.v   ../BranchPredictor.v   ../IndirectBranchPredictor.v   ../LoadBuffer.v   ../StoreQueue.v   ../Multiply.v   ../Divide.v   ../ControlRegs.v   ../PopCnt.v   ../LZCnt.v   ../BranchSelector.v   ../PreDecode.v   ../RenameTable.v   ../TagBuffer.v   ../IssueQueue.v   ../CacheController.v      ../PCFile.v   ../LoadStoreUnit.v   ../TageTable.v   ../TagePredictor.v   ../BranchTargetBuffer.v   ../ICacheTable.v   ../BranchPredictionTable.v   ../ReturnStack.v
set_db library /vol/ece303/genus_tutorial/NangateOpenCellLibrary_typical.lib
set_db lef_library /vol/ece303/genus_tutorial/NangateOpenCellLibrary.lef
elaborate
elaborate
elaborate
elaborate
set_db library /vol/ece303/genus_tutorial/NangateOpenCellLibrary_typical.lib
set_db lef_library /vol/ece303/genus_tutorial/NangateOpenCellLibrary.lef
